#Область СлужебныйПрограммныйИнтерфейс


// Создает файл с подробным описанием ошибок
// 
// Параметры:
// 	Фреймворк - ВнешняяОбработка - Обработка vanessa-automation-single   
// 	ИмяФайла - Строка - сохранить ошибку в файл с указанным именем
// 	ТекстОшибок - Строка - текст ошибки
// Возвращаемое значение:
// 	Строка - Путь к созданному файлу ошибок. Если строка пустая, значит файл не создан.
Функция СоздатьФайлОшибок(Фреймворк, ИмяФайла, ТекстОшибок) Экспорт

	АдресКаталога = Фреймворк.ИмяКаталогаЛогОшибок;
	Если НЕ ЗначениеЗаполнено(АдресКаталога) И ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		АдресКаталога = ОбщегоНазначенияКлиентСервер.КаталогФайловойИнформационнойБазы();
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(АдресКаталога) Тогда
		Возврат "";
	КонецЕсли;	
	ПутьКФайлуОшибок = СтрШаблон("%1\%2", АдресКаталога, ИмяФайла);

	КаталогНаДиске = Новый Файл(АдресКаталога);
	Если НЕ КаталогНаДиске.Существует() Тогда
		СоздатьКаталог(АдресКаталога);
	КонецЕсли;

	РезультатВФайл = Новый ТекстовыйДокумент;
	РезультатВФайл.УстановитьТекст(ТекстОшибок);
	РезультатВФайл.Записать(ПутьКФайлуОшибок);
	
	Возврат ПутьКФайлуОшибок;
	
КонецФункции


#КонецОбласти

