// @strict-types

#Область СлужебныйПрограммныйИнтерфейс

// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//	ПараметрыЗадания - СправочникСсылка.ОбработчикиОчередиЗаданий - параметры задания.
//
Процедура ОбработкаОчередиЗаданийБТС(ПараметрыЗадания) Экспорт
КонецПроцедуры

// Производит планирование выполнения заданий из РС ОчередьЗаданий.
// @skip-warning ПустойМетод - особенность реализации.
// 
Процедура ПланированиеОбработкиЗаданий() Экспорт
КонецПроцедуры

// Процедура выполняет задания из РС ОчередьЗаданий. Отличие от процедуры "ОбработатьОчередьЗаданий" в том,
//	данная процедуры вызывается рег.заданием
// @skip-warning ПустойМетод - особенность реализации.
// 
// Параметры: 
// Задание - СправочникСсылка - ссылка на задание которое требуется выполнить в рамках данной итерации.
// ИдентификаторЗапуска - УникальныйИдентификатор - передается для логирования.
//
Процедура РегламентнаяОбработкаОчередиЗаданий(Задание, ИдентификаторЗапуска = Неопределено) Экспорт
КонецПроцедуры

// @skip-warning ПустойМетод - особенность реализации.
// Возвращаемое значение:
//	Массив из Строка - массив имен методов.
Функция ВозможныеМетоды() Экспорт
КонецФункции

// См. РаботаВМоделиСервисаПереопределяемый.ПриВключенииРазделенияПоОбластямДанных.
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ПриВключенииРазделенияПоОбластямДанных() Экспорт
КонецПроцедуры

// См. ЗагрузкаДанныхИзФайлаПереопределяемый.ПриОпределенииСправочниковДляЗагрузкиДанных
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//	ЗагружаемыеСправочники - ТаблицаЗначений -
//
Процедура ПриОпределенииСправочниковДляЗагрузкиДанных(ЗагружаемыеСправочники) Экспорт
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
КонецПроцедуры

// @skip-warning ПустойМетод - особенность реализации.
Процедура ЗапускОбработкиЗаданий() Экспорт
	
КонецПроцедуры


#КонецОбласти
