#Область ПрограммныйИнтерфейс

//Открывает форму форму оплаты сервиса.
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ОткрытьФормуОплатыСервиса() Экспорт
КонецПроцедуры

// Открывает форму выбора тарифа сервиса.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  КодОбслуживающейОрганизации	 - Число - код обслуживающей организации 
//  Источник -ФормаКлиентскогоПриложения - источник открытия формы
//  ОповещениеОЗакрытии - ОписаниеОповещения - оповещение о закрытии формы выбора тарифа.
//
Процедура ОткрытьФормуВыбораТарифа(КодОбслуживающейОрганизации,  
	Источник = Неопределено, ОповещениеОЗакрытии = Неопределено) Экспорт
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// @skip-warning ПустойМетод - особенность реализации.
// Параметры:
// 	Параметры - см. ОбщегоНазначенияКлиентПереопределяемый.ПриНачалеРаботыСистемы.Параметры
//
Процедура ПриНачалеРаботыСистемы(Параметры) Экспорт
КонецПроцедуры

#КонецОбласти 
