#Область ПрограммныйИнтерфейс

// Вызывается при определении представления валюты оплаты сервиса.
// @skip-warning ПустойМетод - переопределяемый метод.
// 
// Параметры:
//  ПредставлениеВалютыОплаты - Строка - представление валюты оплаты.
//
Процедура ПриУстановкеПредставленияВалютыОплаты(ПредставлениеВалютыОплаты) Экспорт
КонецПроцедуры

// Вызывается при получении имени формы обработки ответа на запрос счета на оплату.
// @skip-warning ПустойМетод - переопределяемый метод.
// 
// Параметры:
//  ИмяФормыОбработкиОтвета - Строка - имя формы обработки ответа.
//
Процедура ПриПолученииИмениФормыОбработкиОтвета(ИмяФормыОбработкиОтвета) Экспорт
КонецПроцедуры

// Вызывается при определении возможности загрузки тарифов сервиса.
// @skip-warning ПустойМетод - переопределяемый метод.
//   
// Параметры:
//  Результат - Булево - результат определения возможности загрузки.
//  
Процедура ПриОпределенииПоддержкиЗагрузкиТарифов(Результат) Экспорт

	
КонецПроцедуры

// Вызывается при загрузке тарифов в информационную базу по данным менеджера сервиса.
// Метод является идемпотентным. Поддерживается повторное выполнение с получением аналогичного результата.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  ИсходныеДанные - Структура:
//   * ТарифыПровайдера - см. ПрограммныйИнтерфейсСервиса.ТарифыСервиса
//   * ТарифыОбслуживающейОрганизации - см. ПрограммныйИнтерфейсСервиса.ТарифыОбслуживающейОрганизации
//
Процедура ПриЗагрузкеТарифов(ИсходныеДанные) Экспорт


КонецПроцедуры

// Вызывается при создании счета на оплату по запросу от менеджера сервиса.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  ДанныеЗапроса - см. ОплатаСервиса.ДанныеЗапросаСчетаНаОплату
//  СчетНаОплату - ДокументСсылка - созданный счет на оплату (возвращаемые данные)
//  РезультатОбработки - Структура - результаты обработки метода (возвращаемые данные):
//   * Ошибка - Булево - признак ошибки обработки
//   * Сообщение - Строка - сообщение об ошибке обработки.
//
Процедура ПриСозданииСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, РезультатОбработки) Экспорт

	
КонецПроцедуры

// Устанавливает печатную форму счета на оплату.
//
// Параметры:
//  ДанныеЗапроса - см. ОплатаСервиса.ДанныеЗапросаСчетаНаОплату
//  СчетНаОплату - ДокументСсылка - счет на оплату
//  ПечатнаяФорма - ТабличныйДокумент - печатная форма счета на оплату (возвращаемые данные)
//  РезультатОбработки - Структура - результаты обработки метода (возвращаемые данные):
//   * Ошибка - Булево - признак ошибки обработки
//   * Сообщение - Строка - сообщение об ошибке обработки.
//
Процедура ПриПолученииПечатнойФормыСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, ПечатнаяФорма, РезультатОбработки) экспорт


КонецПроцедуры

// Устанавливает двоичные данные счета на оплату.
// @skip-warning ПустойМетод - переопределяемый метод.
//  
// Параметры:
//  ДанныеЗапроса - см. ОплатаСервиса.ДанныеЗапросаСчетаНаОплату
//  СчетНаОплату - ДокументСсылка - счет на оплату
//  Данные - ДвоичныеДанные - данные счета на оплату (возвращаемые данные)
//  РезультатОбработки - Структура - результаты обработки метода (возвращаемые данные):
//   * Ошибка - Булево - признак ошибки обработки
//   * Сообщение - Строка - сообщение об ошибке обработки.
//
Процедура ПриПолученииДанныхСчетаНаОплату(ДанныеЗапроса, СчетНаОплату, Данные, РезультатОбработки) Экспорт
	
	
КонецПроцедуры

// Устанавливает значение платежной ссылки счета на оплату.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  ДанныеЗапроса - см. ОплатаСервиса.ДанныеЗапросаСчетаНаОплату
//  СчетНаОплату - ДокументСсылка - счет на оплату
//  ПлатежнаяСсылка - Строка - платежная ссылка (возаращаемые данные)
//  РезультатОбработки - Структура - результаты обработки метода (возвращаемые данные):
//   * Ошибка - Булево - признак ошибки обработки
//   * Сообщение - Строка - сообщение об ошибке обработки.
//
Процедура ПриПолученииПлатежнойСсылки(ДанныеЗапроса, СчетНаОплату, ПлатежнаяСсылка, РезультатОбработки) Экспорт
	
	
КонецПроцедуры

#КонецОбласти